#+setupfile: ./README.org
#+include: ./README.org

# ##################################################################################################

# Adapted From: https://writequit.org/denver-emacs/presentations/files/example.org.html

This is the example org-mode file used for the Denver Emacs org-mode
introduction talk. Everything in this talk should work without any custom
settings or installation with a reasonably recent Emacs version.

Let's start with a headline, this is kind of like Markdown's =#= character:

** tables complex ([[http://orgmode.org/org.html#The-spreadsheet][docu]], [[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][tutorial]])                                  :PARTLY:

- MISSING:
  - Tables are concatenated unfortunately and alignment fails.

#+TBLNAME: mydemo-USD-EUR-rate
| *US-Dollar* |      *EUR* |
|           1 | 0.76481836 |

|     *When* | *What*                 | *USD* | *EUR* |
|------------+------------------------+-------+-------|
| 2012-02-03 | Taxi Graz-Airport      |       | 18.00 |
| 2012-02-03 | Taxi Seattle Airport   | 25.00 | 19.12 |
| 2012-02-13 | Taxi                   |  7.00 |  5.35 |
| 2012-02-14 | Taxi                   |  8.00 |  6.12 |
| 2012-02-17 | Taxi to Airport SeaTac | 35.00 | 26.77 |
| 2012-02-22 | Taxi Airport-Graz      |       | 16.00 |
|------------+------------------------+-------+-------|
|            |                        |       | 91.36 |
#+TBLFM: @>$4=vsum(@I$4..@II$4);%.2f::@3$4=@3$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@4$4=@4$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@5$4=@5$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@6$4=@6$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f

**** example item
:LOGBOOK:
CLOCK: [2012-11-19 Mon 11:16]--[2012-11-19 Mon 11:17] =>  0:01
CLOCK: [2012-11-18 Sun 19:15]--[2012-11-18 Sun 19:23] =>  0:08
:END:

**** another item
:LOGBOOK:
CLOCK: [2012-11-18 Sun 19:26]--[2012-11-18 Sun 19:33] =>  0:07
CLOCK: [2012-11-17 Sat 16:25]--[2012-11-18 Sun 19:25] => 27:00
:END:


** tables

| *head1*               | *head2* | *head3* |
|-----------------------+---------+---------|
| text                  |      42 | -----   |
| me@server.example.com |      23 | :-)     |
|-----------------------+---------+---------|
|                       |      65 |         |
#+TBLFM: @>$2 = vsum(@I$2..@II$2)

** tables complex ([[http://orgmode.org/org.html#The-spreadsheet][docu]], [[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][tutorial]])

- ~C-c |~  move region into table (see [[http://orgmode.org/org.html#Built_002din-table-editor][docu]])
  - TABs, CSV, ...
- ~C-c +~   sum current column (or marked rectangle)

- ~=$1+$2~            value = sum of 1st and 2nd column
- ~:=vsum(@I..@II)~   field = sum between 1st and 2nd hline
- ~C-u C-u C-c C-c~   recompute table with iterations ([[http://orgmode.org/org.html#Updating-the-table][docu]])

- ~#+TBLFM: $3 = $1 + $2~             table formula
- ~#+TBLFM: $1 = -1 + 1 :: @2$1 = 1~  incremental numbers

- ~org-table-import~  import data from CSV file
- ~org-table-export~  export data to CSV file

#+TBLNAME: mydemo-USD-EUR-rate
| *US-Dollar* |      *EUR* |
|           1 | 0.76481836 |

|     *When* | *What*                 | *USD* | *EUR* |
|------------+------------------------+-------+-------|
| 2012-02-03 | Taxi Graz-Airport      |       | 18.00 |
| 2012-02-03 | Taxi Seattle Airport   | 25.00 | 19.12 |
| 2012-02-13 | Taxi                   |  7.00 |  5.35 |
| 2012-02-14 | Taxi                   |  8.00 |  6.12 |
| 2012-02-17 | Taxi to Airport SeaTac | 35.00 | 26.77 |
| 2012-02-22 | Taxi Airport-Graz      |       | 16.00 |
|------------+------------------------+-------+-------|
|            |                        |       | 91.36 |
#+TBLFM: @>$4=vsum(@I$4..@II$4);%.2f::@3$4=@3$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@4$4=@4$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@5$4=@5$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@6$4=@6$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f

- ~C-c C-c~   update values
- ~C-c }~     visualize rows/columns
- ~C-c '~     edit formula in separate buffer
  - ~C-c C-r~ switch between internal references (@3$2) and standard references (B3)
  - ~S-<up>/<down>/<left>/<right>~  shift reference at point
- [[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html#sec-7][debugging formulas]]

- many, many, many more table features in the documentation!
  - http://orgmode.org/worg/org-tutorials/index.html#sec-3-2
  - http://orgmode.org/worg/org-faq.html#Tables
    - [[http://orgmode.org/worg/org-faq.html#fill-table-column-with-incremental-numbers][incremental numbers]], [[http://orgmode.org/worg/org-faq.html#table-column-filled-with-ERROR][what to do on #ERROR in columns]], ...
  - http://orgmode.org/worg/org-hacks.html#sec-1-4
    - calculations using time, date, hex, GPS, ...

**** column-based

#+NAME: Income2012v
|       | Income May 2012 | Income June 2012 |
|-------+-----------------+------------------|
| Joe   |              12 |               10 |
| Alice |              22 |               24 |
| Bob   |              16 |               17 |
|-------+-----------------+------------------|
| sum   |              50 |               51 |

#+NAME: comparison-table-vertical
|       | June 2012 (from above) | plus 20 percent | June 2013 | Difference |
|-------+------------------------+-----------------+-----------+------------|
| Joe   |                     10 |            12.0 |        11 |       -1.0 |
| Alice |                     24 |            28.8 |        31 |        2.2 |
| Bob   |                     17 |            20.4 |        21 |        0.6 |
|-------+------------------------+-----------------+-----------+------------|
| sum   |                     51 |                 |           |        1.8 |
#+TBLFM: @>$5=vsum(@I..@II)::@>$3=string("")::$1='(identity remote(Income2012v, @@#$1))::$2='(identity remote(Income2012v, @@#$3))::$3=1.2 * remote(Income2012v, @@#$3);%.1f::$5=$4-$3;%.1f

- all formulas explained in detail:
  - ~@>$5=vsum(@I..@II)~
    - value: ~1.8~
    - last row (~@>~) of column five (~$5~) is the sum of column five
      between first and second horizontal line (~@I..@II~)
  - ~@>$3=string("")~
    - no value (empty)
    - overwrite the last row (~@>~) of column three (~$3~) with an empty
      string
    - otherwise it would get 1.2 times the value of corresponding
      column of table Income2012v as well - I chose not to want this
      sum in this column
  - ~$1='(identity remote(Income2012v, @@#$1))~
    - values: ~Joe~ until ~sum~
    - copy content of the first column of table "Income2012v"
      (Lisp formula ~'(identity remote(Income2012v, @@#$1))~) to the first
      column in this table
      (~$1~)
    - the "identity" statement prevents calc from interpreting the content
    - this is because I am too lazy to enter all names once again :-)
    - see also [[http://orgmode.org/worg/org-hacks.html#field-coordinates-in-formulas][Org-hacks]] for field formulas
  - ~$2='(identity remote(Income2012v, @@#$3))~
    - values: ~10; 24; 17; 51~
    - copy the content of the second column of table "Income2012v" to the
      second column in this table
    - you could skip this column and calculate the values of the next
      columns with direct references to ~remote(Income2012v, @@#$3)~
      as well. However, it is more easy to compare visually if the
      values from 2012 are shown here as well (usability/readability)
    - note: by convention, only the values after the first horizontal
      line are taken
  - ~$3=1.2 * remote(Income2012v, @@#$3);%.1f~
    - values: ~12.0; 28.8; 20.4; 61.2~
    - column three (~$3~) is 120 percent of the values of the third
      column of table "Income2012v" with one decimal place (~;%.1f~)
    - note: 61.2 (1.2 times 51) is overwritten by formula ~@>$3~ from
      above
  - ~$5=$4-$3;%.1f~
    - values: ~-1.0; 2.2; 0.6~
    - column five (~$5~) is the difference between column four to
      column three with one decimal place

Here is another example: how to sum up the numbers of the first column
so far:

#+NAME: Sum-up-of-other-column
| Numbers | Sum of numbers so far |
|---------+-----------------------|
|       1 |                     1 |
|       5 |                     6 |
|      10 |                    16 |
|      50 |                    66 |
|     200 |                   266 |
|    1000 |                  1266 |
#+TBLFM: @3$2..@>$2=vsum(@2$1..$-1)

The formular can be simplified even more by using a column formula:
~#+TBLFM: $2=vsum(@2$1..$-1)~ provides the same result as above.

**** row-based

#+NAME: Income2012h
|                  | Joe | Alice | Bob | sum |
| Income May 2012  |  12 |    22 |  16 |  50 |
| Income June 2012 |  10 |    24 |  17 |  51 |

#+NAME: comparison-table-horizontal
|                  |  Joe | Alice |  Bob |  sum |
| Income June 2012 |   10 |    24 |   17 |   51 |
| plus 20 percent  | 12.0 |  28.8 | 20.4 | 60.0 |
| June 2013        |   11 |    31 |   21 |      |
| Difference       | -1.0 |   2.2 |  0.6 |  1.8 |
#+TBLFM: @>$>=vsum(@5$2..@5$4)::@1$2..@1$4='(identity remote(Income2012h, @1$$#))::@2='(identity remote(Income2012h, @3$$#))::@3$2..@3$4=1.2 * remote(Income2012h, @3$$#);%.1f::@5$2..@5$4=@4-@3;%.1f

- all formulas explained in detail:
  - ~@>$>=vsum(@5$2..@5$4)~
    - value: ~1.8~
    - last column in last row (~@>$>~) is the vector-sum (~vsum~) of
      column two to four of fifth row (~@5$2..@5$4~)
  - ~@1$2..@1$4='(identity remote(Income2012h, @1$$#))~
    - values: ~Joe | Alice |  Bob |  sum~
    - column two to four of first row (~@1$2..@1$4~) are copied from
      the corresponding fields of the first row (~@1$$#~) of table
      "Income2012h"
    - see also [[http://orgmode.org/worg/org-hacks.html#field-coordinates-in-formulas][Org-hacks]] for field formulas
  - ~@2='(identity remote(Income2012h, @3$$#))~
    - values: ~2012 Income June |   10 |    24 |   17 |   51~
    - the second row (~@2~) is copied from the corresponding fields of
      the first row (~@1$$#~) of table "Income2012h"
    - my guess: "2012" is moved to the beginning of the field most
      probably because it is interpreted as numeric value and not as
      string
  - ~@3$2..@3$4=1.2 * remote(Income2012h, @3$$#);%.1f~
    - values: ~12.0 |  28.8 | 20.4 | 60.0~
    - the columns two to four of the third row (~@3$2..@3$4~) is 120
      percent of the corresponding values of the third row (~@3$$#~)
      of the table "Income2012h" with one decimal place (~;%.1f~)
  - ~@5$2..@5$4=@4-@3;%.1f~
    - values: ~-1.0 |   2.2 |  0.6~
    - the column two to four of the fifth row (~@5$2..@5$4~) is the
      difference of the values in the corresponding values of the
      fourth row and the third row (~@4-@3~) with one decimal place
      (~;%.1f~)

**** example item
:LOGBOOK:
CLOCK: [2012-11-19 Mon 11:16]--[2012-11-19 Mon 11:17] =>  0:01
CLOCK: [2012-11-18 Sun 19:15]--[2012-11-18 Sun 19:23] =>  0:08
:END:

**** another item
:LOGBOOK:
CLOCK: [2012-11-18 Sun 19:26]--[2012-11-18 Sun 19:33] =>  0:07
CLOCK: [2012-11-17 Sat 16:25]--[2012-11-18 Sun 19:25] => 27:00
:END:

